routes/channels.php

}, ['guards' => 'advisor']);

Broadcast::channel('App.Models.Manager.{id}', function ($user, $id) {
    $manager_db = Manager::where('firebase_uid', $user->localId)->first();
---
select * from `managers` where `firebase_uid` = 'PlvIomQcHHUAVW4UUXGjr2kE8W02' limit 1