app/helpers.php

select * from `managers` where `firebase_uid` = 'PlvIomQcHHUAVW4UUXGjr2kE8W02' limit 1
---
function auth_manager()
{
    $manager = Auth::guard('manager')->user();
    $manager_db = Manager::where('firebase_uid', $manager->localId)->first();