app/Http/Controllers/Manager/ManagerController.php

select * from `training_program_users` where `status` = 'pending' order by `created_at` desc limit 5
select count(*) as aggregate from `trainees` where `trainees`.`deleted_at` is null
select count(*) as aggregate from `advisors` where `advisors`.`deleted_at` is null
select * from `training_program_users`
select count(*) as aggregate from `training_programs` where `training_programs`.`deleted_at` is null
select count(*) as aggregate from `disciplines` where `disciplines`.`deleted_at` is null
---
    public function index()
    {
        $training_requests = TrainingProgramUser::where('status', 'pending')->orderBy('created_at', 'desc')->take(5)->get();
        $trainees_count = Trainee::count();
        $advisors_count = Advisor::count();
        $all_training_requests = TrainingProgramUser::all();
        $training_programs_count = TrainingProgram::count();
        $disciplines_count = Discipline::count();

select count(*) as aggregate from `training_program_users` where `status` = 'pending'
---
    public function training_requests()
    {
        $paginate = 5;
        $training_requests = TrainingProgramUser::where('status', 'pending')->paginate($paginate);