app/Models/Trainee.php

    public function getCvAttribute()
    {
        return $this->files()->where('name', 'like', $this->firebase_uid . '_trainee_cv%')->first()?->url;
---
select * from `files` where `files`.`trainee_id` = 2 and `files`.`trainee_id` is not null and `name` like 'J3sl2qj2f7NISuqfFuRGtvlkdKA2_trainee_avatar_image%' limit 1